Tekla Open API Reference for Tekla Structures 2025
Events.DrawingEditorClosed Event
 The DrawingEditorClosed event is raised when the drawing editor is closed.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.DrawingEditorClosedDelegate DrawingEditorClosed
Public Event DrawingEditorClosed As Events.DrawingEditorClosedDelegate
Value
Type: Tekla.Structures.Drawing.UI.Events.DrawingEditorClosedDelegate
Implements
IUIEvents.DrawingEditorClosed
See Also
Reference
Events Class
Tekla.Structures.Drawing.UI Namespace